---
kind: property
id: P:Autodesk.Revit.DB.PrintSetting.Name
source: html/b56ae89d-8359-d61c-78ce-88891b4a3862.htm
---
# Autodesk.Revit.DB.PrintSetting.Name Property

Returns the Name of Print Setup.

## Syntax (C#)
```csharp
public override string Name { get; set; }
```

## Remarks
Retrieve/set the name of Print Setup.